Repository: Adialia/sweet-recommender-system
Catalog: src/sweetrs/locale/*/LC_MESSAGES/django.po
Languages: pl

source: Product name
pl: Nazwa produktu

source: Description
pl: Opis

source: Rating
pl: Ocena

source: Add photo
pl: Dodaj zdjęcie

source: Please provide photos with white background - it really looks much nicer :)
pl: Proszę dodawać zdjęcia z białym tłem - wyglądają dużo fajniej :)

source: Rate sweets
pl: Oceń słodycze

source: Please give a mark on the 1-5 scale where:
pl: Proszę podać ocenę w skali 1-5

source: 1 means very poor, I don't like it,
pl: 1 znaczy bardzo słaby, Nie lubię tego,

source: 5 means excelent, I'm lovin' it.
pl: 5 oznacza rewelacja, Kocham to.

source: If you haven't tried given product just mark it so. Then the algorithm will know if it should be taken into account during recommendation process.
pl: Jeśli nie próbowałeś danego produktu oznacz go w ten sposób Wtedy algorytm wie, że nie powinien brać go pod uwagę.

source: Progress
pl: Postęp

source: already rated
pl: już oceniony

source: You have already rated all sweets. Thanks! Now you can check recommends!
pl: Oceniłeś już wszystkie słodycze. Dzięki! Teraz możesz zobaczyć rekomendacje

source: Provide email
pl: Podaj e-mail

source: In order to see results please provide e-mail or secret key received by e-mail
pl: Aby zobaczyć wyniki podaj swój e-mail lub klucz otrzymany przez e-mail.

source: If you have already finished once, you can use the key (received by e-mail) to find results
pl: Jeśli raz już wypełniłeś ankietę, użyj swojego klucza (otrzymanego mailem)

source: Secret
pl: Klucz

source: Users
pl: Użytkownicy

source: Your tau correlation coefficients with other sweetrs users. I will give some details later, right now you can read something on <a href='http://en.wikipedia.org/wiki/Pearson_correlation'>wikipedia</a>.
pl: Twój współczynnik tau z innymi użytkownikami. W przyszłości napiszę więcej na ten temat, ale teraz możesz poczytać coś tutaj <a href='http://pl.wikipedia.org/wiki/Wsp%C3%B3%C5%82czynnik_korelacji_Pearsona'>wikipedia</a>.

source: User
pl: Użytkownik

source: Your correlation with this user
pl: Twoja korelacja z tym użytkownikiem

source: Ratings
pl: Oceny

source: Product
pl: Produkt

source: Your rate
pl: Twoja ocena

source: Prediction
pl: Predykcja

source: Sweet Recommender System
pl: SweetRS - System Rekomendacji Słodyczy

source: Contribute to scientific project and find out which sweets you like.
pl: Weź udział w projekcie naukowym i zobacz jakie nowe słodycze byś polubił.

source: About the project
pl: O projekcie

source: Review
pl: Oceniaj

source: Recommendations
pl: Rekomendacje

source: Add sweets
pl: Dodaj słodycze

source: FAQ
pl: Pytania

source: Choose language
pl: Wybierz język

source: C is for cookie, it's good enough for me,<br />oh cookie cookie cookie starts with C.
pl: C jest dla ciasteczek i mi zupełnie wystarcza,<br />oh ciasteczko, ciasteczko, ciasteczko zaczyna się na C

source: Cookie monster
pl: Ciasteczkowy potwór

source: Hello
pl: Cześć

source: If you have found this website you are probably in my social circle. That's great. You might even know that my name is
pl: Jeśli tutaj trafiłeś to prawdopodobnie jesteś moim znajomym (lub znajomym znajomego :). Super! Możesz nawet wiedzieć, że nazywam się

source: and I'm a wannabe computer scientist from Poland. I'm working on my master's thesis right now which is the recommender system.
pl: i jestem prawie-naukowcem z Polski. Pracuję nad pracą magisterską, którą będzie system rekomendacji.

source: Contribute to scientific project - all I need is your 5 minutes
pl: Weź udział w projekcie naukowym - potrzebuję tylko Twoich 5 minut

source: On this website I ask for your ratings of popular sweets. Then my systems predicts which sweets you would prefer from those which you don't know!
pl: Na tej stronie pytam o oceny popularnych słodyczy. Mój systemprzewiduje oceny słodyczy które by Ci się podobały (i których nie znasz)!

source: 2 easy steps to help me:
pl: 2 proste kroki by mi pomóc:

source: try to provide ratings for as much sweets as you can. If you haven't eaten given sweet then mark it that way because this information is also important.
pl: spróbuj ocenić jak najwięcej słodyczy. Jeśli czegoś nie jadłeśto kliknij odpowiedni przycisk by system wiedział co ma ocenić za Ciebie!

source: Enjoy recommends
pl: Ciesz się rekomendacjami

source: find out which new sweets you'd like. Enjoy them or not and give me feedback afterwards :)
pl: zobacz które słodycze byś lubił. Ciesz się nimi lub nie i daj mi znać czy system pomógł :)

source: What do I need?
pl: Czego potrzebuję?

source: In order to build reliable system I need at least:<br />500 users and about 10000 marks
pl: Aby zbudować wartościowy system potrzebuję co najmniej:<br />500 użytkowników i około 10000 ocen

source: So far...
pl: Aktualnie...

source: users contributed
pl: użytkowników pomogło

source: ratings provided
pl: ocen

source: Still not sure?
pl: Wciąć nie jesteś przekonany

source: Read more in
pl: Przeczytaj więcej na

source: or contact
pl: lub skontaktuj

source: me
pl: ze mną

source: Do you like it? Click 'LIKE'!
pl: Podobało się? Kliknij 'LUBIĘ TO'!

source: It will help me in promoting this application.
pl: Pomoże mi to w promowaniu systemu

source: Why sweets?
pl: Dlaczego słodycze?

source: everyone have already eaten some,
pl: każdy kiedyś jakieś zjadł,

source: there are lots of them, but the set can be easly shrinked,
pl: jest ich mnóstwo, ale zbiór można łatwo zawęzić,

source: it's quite easy to distinguish whether we like given candy or not,
pl: jest dość łatwo ocenić czy któreś lubimy czy nie

source: as long as candies are not considered to be the most important thing on the planet, it won't shift the focus from making great algorithm to the product itself,
pl: dopóki słodycze nie są najważniejszą rzeczą na świecie, temat nie spowoduje, że ta strona zamiast służyć nauce przekształci się w produkt komercyjny.

source: How does it work?
pl: Jak to działa?

source: I have populated database of candies with some "international" ones. People who had joined this project (just by clicking 'Review') review those items on the 1-5 grade. The algorithm which I'm going to build as my master thesis gathers all data and recommends you sweets that you haven't ever tried and that you would like.
pl: Dodałem do bazy trochę słodyczy znanych na całym świecie. Ludzie którzy już pomogli (klkikając 'Oceniaj') ocenili te produkty w skali od 1 do 5.Algorytm który buduję jako pracę magisterską zbiera te dane i podpowiada które słodycze by Ci się podobały.

source: Sounds great to me, how can I contribute?
pl: Brzmi super, jak mogę pomóc?

source: Just rate some products, check your recommendations and have fun with exploring new candies :)
pl: Wystarczy, że ocenisz produkty. Sprawdź rekomendacje i ciesz się propozycjami.

source: I love this project - could I help more somehow?
pl: Uwielbiam ten produkt - czy mogę jeszcze jakoś pomóc?

source: Sure. Just contact me and tell something about your background, ie. are you mathematician, statistician, software engineer, candy lover, taxi driver or graphic designer.
pl: Jasne! Po prostu napisz do mnie i powiedz mi czym się zajmujesz, tj. czy jesteś matematykiem, statystykiem, programistą, miłośnikiem słodyczy, taksówkarzem czy grafikiem.

source: Is it innovative anyhow?
pl: Czy to jest innowacyjne?

source: The idea is already used by many companies, however there are not many open-source approaches.
pl: Sam pomysł jest już używany przez wiele korporacji, ale wersji 'otwartych' jeszcze nie ma wielu.

source: Why should one bother about creating good recommender system?
pl: Po co zajmować się tworzeniem systemu rekomendacji?

source: Because I have to create something for my master thesis :). There are some recommender systems but there are also some issues:
pl: Bo muszę jakoś napisać pracę magisterską :). Jest wiele systemów rekomendacji, ale jest też kilka poblemów:

source: most of them are closed sourced so one can't check why he was given such recommendations (it may lead to abuses),
pl: większość z nich ma zamknięty kod źródłowy i nie można sprawdzić dlaczego dany produkt został zaproponowany (co prowadzi do nadużyć).

source: there is always problem with getting relevant data (there are not many institutions that provide it for free),
pl: zawsze jest problem ze zbieraniem danych (większość firm nie udostępnia ich za darmo).

source: Add
pl: Dodaj

source: Your e-mail is needed only for ensuring that you are serious person. :)
pl: Twój e-mail jest potrzebny tylko po to by zagwarantować, że jesteś poważną osobą. :)
